fast_finish_2026/LR3/sphere/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultValues
{
    alpha.water     0;
}

zones
{
    waterSphere
    {
        type            sphere;

        centre          (0.3 0.3 0);
        radius          0.1;

        values
        {
            alpha.water     1;
        }
    }
}


// ************************************************************************* //
